app/controllers/search_controller.rb

SELECT "books".* FROM "books" WHERE "books"."title" = ?  [["title", "タイトル2"]]
SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "だはは"]]
---
  def search
    @model_name = params[:model_name]
    search_text = params[:search_text]
    search_method = params[:search_method]
    if "book" == @model_name
      if search_method == "forward_match"
              @books = Book.where("title LIKE?","#{search_text}%")
      elsif search_method == "backward_match"
              @books = Book.where("title LIKE?","%#{search_text}")
      elsif search_method == "perfect_match"
              @books = Book.where(title: search_text)
      elsif search_method == "partial_match"
              @books = Book.where("title LIKE?","%#{search_text}%")
      else
              @books = Book.all
      end

    elsif "user" == @model_name
     if search_method == "forward_match"
              @users = User.where("name LIKE?","#{search_text}%")